# Question 1 Part 2
- Use ‘vehicle_collisions’ data set
- For each borough, find out distribution of each collision scale. (One carinvolved? Two? Three? or more?) (From 2015 to present)
- Display a few rows of the output use df.head()
- Generate a csv output with five columns ('borough', 'one-vehicle', 'two- vehicles', 'three-vehicles', 'more-vehicles')

In [1]:
import pandas as pd

In [12]:
# drop unnecessary columns
raw_df = pd.read_csv('Data/vehicle_collisions.csv')
col_list = ['BOROUGH', 'VEHICLE 1 TYPE', 'VEHICLE 2 TYPE', 'VEHICLE 3 TYPE', 'VEHICLE 4 TYPE']
raw_df = raw_df[col_list]
raw_df.head(4)

,BOROUGH,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE
0,QUEENS,SPORT UTILITY/STATION WAGON,NaN,NaN,NaN
1,NaN,PASSENGER VEHICLE,NaN,NaN,NaN
2,BROOKLYN,PASSENGER VEHICLE,UNKNOWN,NaN,NaN
3,BROOKLYN,BUS,PASSENGER VEHICLE,NaN,NaN

In [13]:
# if vehicle type is not null, mark it with 1
raw_df.loc[raw_df['VEHICLE 1 TYPE'].notnull(), 'VEHICLE 1 TYPE'] = 1
raw_df.loc[raw_df['VEHICLE 2 TYPE'].notnull(), 'VEHICLE 2 TYPE'] = 1
raw_df.loc[raw_df['VEHICLE 3 TYPE'].notnull(), 'VEHICLE 3 TYPE'] = 1
raw_df.loc[raw_df['VEHICLE 4 TYPE'].notnull(), 'VEHICLE 4 TYPE'] = 1
raw_df.head(5)

    BOROUGH VEHICLE 1 TYPE VEHICLE 2 TYPE VEHICLE 3 TYPE VEHICLE 4 TYPE
0    QUEENS              1            NaN            NaN            NaN
1       NaN              1            NaN            NaN            NaN
2  BROOKLYN              1              1            NaN            NaN
3  BROOKLYN              1              1            NaN            NaN
4       NaN              1              1            NaN            NaN

In [18]:
# sum up the vehicle types, the numbers indicate how many 'vehicle X type' is not null
gr = raw_df.groupby('BOROUGH', as_index=False)
sum_gr = gr.sum()
sum_gr

,BOROUGH,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE
0,BRONX,45599,36972,2587,625
1,BROOKLYN,104174,86799,6592,1612
2,MANHATTAN,82801,69483,2525,501
3,QUEENS,89140,76178,5918,1420
4,STATEN ISLAND,13943,11600,924,165

In [19]:
# calculate the needed values
sum_gr['ONE_VEHICLE_INVOLVED'] = sum_gr['VEHICLE 1 TYPE'] - sum_gr['VEHICLE 2 TYPE'] - sum_gr['VEHICLE 3 TYPE'] - sum_gr['VEHICLE 4 TYPE']
sum_gr['TWO_VEHICLE_INVOLVED'] = sum_gr['VEHICLE 2 TYPE'] - sum_gr['VEHICLE 3 TYPE'] - sum_gr['VEHICLE 4 TYPE']
sum_gr['THREE_VEHICLE_INVOLVED'] = sum_gr['VEHICLE 3 TYPE'] - sum_gr['VEHICLE 4 TYPE']
sum_gr['MORE_VEHICLE_INVOLVED'] = sum_gr['VEHICLE 4 TYPE']
sum_gr

,BOROUGH,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE,ONE_VEHICLE_INVOLVED,TWO_VEHICLE_INVOLVED,THREE_VEHICLE_INVOLVED,MORE_VEHICLE_INVOLVED
0,BRONX,45599,36972,2587,625,5415,33760,1962,625
1,BROOKLYN,104174,86799,6592,1612,9171,78595,4980,1612
2,MANHATTAN,82801,69483,2525,501,10292,66457,2024,501
3,QUEENS,89140,76178,5918,1420,5624,68840,4498,1420
4,STATEN ISLAND,13943,11600,924,165,1254,10511,759,165

In [20]:
# drop unnecessary columns
col_list = ['BOROUGH', 'ONE_VEHICLE_INVOLVED', 'TWO_VEHICLE_INVOLVED', 'THREE_VEHICLE_INVOLVED', 'MORE_VEHICLE_INVOLVED']
out_df = sum_gr[col_list]
out_df

,BOROUGH,ONE_VEHICLE_INVOLVED,TWO_VEHICLE_INVOLVED,THREE_VEHICLE_INVOLVED,MORE_VEHICLE_INVOLVED
0,BRONX,5415,33760,1962,625
1,BROOKLYN,9171,78595,4980,1612
2,MANHATTAN,10292,66457,2024,501
3,QUEENS,5624,68840,4498,1420
4,STATEN ISLAND,1254,10511,759,165

In [21]:
# save to csv
out_df.to_csv('output_csv/q1p2_output.csv',index=False,header=True)